{"data": [
  {
    "title": "Super low frequency (SLF): Because of the extreme difficulty of building transmitters that can generate such long waves, frequencies in this range have been used in very few artificial communication systems. However, SLF waves can penetrate seawater to a depth of hundreds of meters. Therefore, in recent decades the U.S., Russian and Indian military have built huge radio transmitters using SLF frequencies to communicate with their submarines.",
    "start": 30,
    "end": 300,
    "bar": 1
  },
  {
    "title": "Ultra low frequency (ULF): Many types of waves in the ULF frequency band can be observed in the magnetosphere and on the ground. These waves represent important physical processes in the near-Earth plasma environment. The speed of the ULF waves is often associated with the Alfvén velocity that depends on the ambient magnetic field and plasma mass density. This band is used for communications in mines, as it can penetrate the earth.",
    "start": 300,
    "end": 3000,
    "bar": 1
  },
  {
    "title": "Very low frequency (VLF): Due to its limited bandwidth, audio (voice) transmission is highly impractical in this band, and therefore only low data rate coded signals are used. The VLF band is used for a few radio navigation services, government time radio stations (broadcasting time signals to set radio clocks) and for secure military communication.",
    "start": 3e3,
    "end": 30e3,
    "bar": 1
  },
  {
    "title": "Low frequency (LF): exhibits low signal attenuation, making them suitable for long-distance communications. In Europe and areas of Northern Africa and Asia, part of the LF spectrum is used for AM broadcasting as the \"longwave\" band. In the western hemisphere, its main use is for aircraft beacon, navigation (LORAN), information, and weather systems. A number of time signal broadcasts are also broadcast in this band.",
    "start": 30e3,
    "end": 30e4,
    "bar": 1
  },
  {
    "title": "Medium frequency (MF): mostly used for AM radio broadcasting, navigational radio beacons, maritime ship-to-shore communication, and transoceanic air traffic control.",
    "start": 300e3,
    "end": 3e6,
    "bar": 1
  },
  {
    "title": "High frequency (HF): Because radio waves in this band can be reflected back to Earth by the ionosphere layer in the atmosphere – a method known as \"skip\" or \"skywave\" propagation – these frequencies are suitable for long-distance communication across intercontinental distances. The band is used by international shortwave broadcasting stations (2.31–25.82 MHz), aviation communication, government time stations, weather stations, amateur radio and citizens band services, among other uses.",
    "start": 3e6,
    "end": 30e6,
    "bar": 1
  },
  {
    "title": "Very high frequency (VHF): Common uses are FM radio broadcasting, television broadcasting, two way land mobile radio systems (emergency, business, private use and military), long range data communication up to several tens of kilometers with radio modems, amateur radio, and marine communications. Air traffic control communications and air navigation systems (e.g. VOR & ILS) work at distances of 100 kilometers or more to aircraft at cruising altitude.",
    "start": 30e6,
    "end": 30e7,
    "bar": 1
  },
  {
    "title": "Super high frequency (SHF): radio waves with these frequencies are called microwaves. The small wavelength of microwaves allows them to be directed in narrow beams by aperture antennas such as parabolic dishes and horn antennas, so they are used for point-to-point communication and data links and for radar. This frequency range is used for most radar transmitters, wireless LANs, satellite communication, microwave radio relay links, and numerous short range terrestrial data links. They are also used for heating in industrial microwave heating, medical diathermy, microwave hyperthermy to treat cancer, and to cook food in microwave ovens.",
    "start": 3e9,
    "end": 30e9,
    "bar": 1
  },
  {
    "title": "Extremely high frequency (EHF): radio waves in this band have high atmospheric attenuation: they are absorbed by the gases in the atmosphere. Therefore, they have a short range and can only be used for terrestrial communication over about a kilometer. Absorption by humidity in the atmosphere is significant except in desert environments, and attenuation by rain (rain fade) is a serious problem even over short distances. However the short propagation range allows smaller frequency reuse distances than lower frequencies. The short wavelength allows modest size antennas to have a small beam width, further increasing frequency reuse potential.",
    "start": 30e9,
    "end": 30e10,
    "bar": 1
  },
  {
    "title": "Extremely low frequency (ELF): generated by lightning and natural disturbances in Earth's magnetic field, so they are a subject of research by atmospheric scientists. Because of the difficulty of building antennas that can radiate such long waves, ELF frequencies have been used in only a very few human-made communication systems. ELF waves can penetrate seawater, which makes them useful in communication with submarines.",
    "start": 3,
    "end": 30,
    "bar": 1
  },
  {
    "title": "Ultra high frequency (UHF): used for television broadcasting, cell phones, satellite communication including GPS, personal radio services including Wi-Fi and Bluetooth, walkie-talkies, cordless phones, and numerous other applications.",
    "start": 300e6,
    "end": 3e9,
    "bar": 1
  },
  
  {
    "title": "Far infrared",
    "start": 300e9,
    "end": 20e12,
    "bar": 1
  },
  {
    "title": "Mid infrared",
    "start": 20e12,
    "end": 214e12,
    "bar": 1
  },
  {
    "title": "Near infrared",
    "start": 214e12,
    "end": 400e12,
    "bar": 1
  },
  {
    "title": "Near ultraviolet",
    "start": 400e12,
    "end": 2.418e15,
    "bar": 1
  },
  {
    "title": "Extreme ultraviolet",
    "start": 2.418e15,
    "end": 2.998e16,
    "bar": 1
  },
  {
    "title": "Soft x-rays",
    "start": 2.998e16,
    "end": 1.5e18,
    "bar": 1
  },
  {
    "title": "Hard x-rays",
    "start": 1.5e18,
    "end": 3e18,
    "bar": 1
  },
  {
    "title": "Gamma rays",
    "start": 3e18,
    "end": 3e20,
    "bar": 1
  }
]
}
